// 订单状态 1已创建订单 未付款 2已付款 8已过期 9已取消 10已确定 11已评价 12 已分享
  // 生产状态 0 已付款未下单 -- 1 已支付，并且已下单 -- 2 已打印 -- 3 已叫号 -- 5 已下单未打印（异常订单）
  // 订单状态配置
  export const order = {
    0: {txt: '未提交'}, // 购物车状态
    1: {txt: '未付款'},  
    2: {txt: '已付款'},
    8: {txt: '已过期'},
    9: {txt: '已取消'},
    10:{txt: '已消费'}, // 已消费
    11:{txt: '已评价'},
    12:{txt: '已分享'}
  }
  // 生产状态配置
  export const production = {
    0: {txt: '待下单'},   //已付款,未下单
    1: {txt: '待接单'},   //已支付,并且已下单
    2: {txt: '等待叫号'}, //已打印
    3: {txt: '已消费'},   //已叫号
    4: {txt: '已消费'},   //已取餐          //(R+外卖、计费系统要用)
    5: {txt: '下单失败'},         //打印异常  已下单,未打印
    6: {txt: '退菜取消'}          //退菜，订单已取消
  }

  // 店铺|订单模式
  // orderMode|shopMode 1:（废弃） 2:电视叫号 3:验证码 4：废弃 5：废弃 6： boss（有先付后付）7：美食广场模式

  // distributionModeId 1: 堂食  2: 外卖 3: 外带
  // 先付后付
  // 店铺配置 allowFirstPay 0开启1关闭  allowAfterPay  0开启1关闭
  // payType              // 0:先付 1:后付 

  // 支付模式
  // payMode 
  export const payMode = {
    YUE_PAY: 0,       //余额支付
    WX_PAY: 1,        //微信支付
    ALI_PAY: 2,       //支付宝支付
    YL_PAY: 3,        //银联支付
    XJ_PAY: 4,        //现金支付
    SHH_PAY: 5,       //新美大支付
    JF_PAY: 6,        //会员支付
    CARD_PAY: 7,      //美食广场分之使用
    MD_PAY: 8,        //免单支付
    GROUP_PAY: 9,             //团购支付
    CASH_COUPIN_PAY: 10,      //代金券支付
    ALL_TYPE_PAY: 99,         //混合支付
  }

  // couponType -1:通用,0:新用户注册,1:邀请注册,2:生日,3:分享,4:实时


  // 客户端foodtype定义 1：我是单品；2：我是套餐；3：单品老规格； 4：单品新规格；5：重量包；
  // 服务端type定义 1：无规格单品，2：老规格单品，3：套餐主品，4:套餐的子菜 5：新规格单品 6:推荐配餐 8：重量包

  // orderInfo钱的一些字段
  // payment_amount =	order_money - (系统内钱)= 第三方要付的钱
  // order_money = 菜品最终金额 + 餐盒费+服务费
  // amountWithChildren = 后付情况下 （菜品最终金额 + 餐盒费+服务费）
